# Part3: Construct and export a MySQL database

# Import Libraries

In [1]:
import pandas as pd
import os, time,json
import tmdbsimple as tmdb 
from tqdm.notebook import tqdm_notebook
import seaborn as sns
import matplotlib.pyplot as plt

import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

# Normalizing Genres

In [2]:
# load title_basics csv file
title_basics = pd.read_csv("Data/title_basics.csv.gz")
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

## Getting List of Unique Genres

In [3]:
test = title_basics['genres'][0]
type(test)

str

In [4]:
# create a new column with the single string genres as a list of strings
title_basics['genres_split'] =title_basics['genres'].str.split(',')
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama,[Drama]

In [5]:
test = title_basics['genres_split'][0]
type(test)

list

In [6]:
# Separate the list of genres into new rows 
exploded_genres = title_basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
84503,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Action
84503,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Adventure
84503,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
84504,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
84504,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [7]:
# get the unique genres from the genres_split column
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

## Create a new title_genres table

In [8]:
# create a new title_genres from the exploded_genres
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

## Create a genre mapper dictionary to replace string genres with integers

In [9]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

## Replace the string genres in title_genres with the new integer ids

In [10]:
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres

          tconst genres_split  genre_id
0      tt0035423       Comedy         5
0      tt0035423      Fantasy         9
0      tt0035423      Romance        18
1      tt0062336        Drama         7
2      tt0069049        Drama         7
...          ...          ...       ...
84503  tt9916190       Action         0
84503  tt9916190    Adventure         2
84503  tt9916190     Thriller        23
84504  tt9916362        Drama         7
84504  tt9916362      History        11

[157892 rows x 3 columns]

In [11]:
# Drop the "genres_split" column
title_genres.drop(columns = ['genres_split'], axis = 1, inplace = True)
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
84503  tt9916190         0
84503  tt9916190         2
84503  tt9916190        23
84504  tt9916362         7
84504  tt9916362        11

[157892 rows x 2 columns]

## Convert the genre map dictionary into a dataframe

In [12]:
genres = pd.DataFrame({'genre_name': genre_map.keys(),
                            'genre_id': genre_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

# Discard unnecessary information in tables

In [13]:
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama,[Drama]

In [14]:
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84505 entries, 0 to 84504
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          84505 non-null  object
 1   titleType       84505 non-null  object
 2   primaryTitle    84505 non-null  object
 3   originalTitle   84505 non-null  object
 4   isAdult         84505 non-null  int64
 5   startYear       84505 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  84505 non-null  int64
 8   genres          84505 non-null  object
 9   genres_split    84505 non-null  object
dtypes: float64(1), int64(3), object(6)
memory usage: 6.4+ MB

In [15]:
#drop unneecessary cilumns from titile_basics table
title_basics.drop(columns = ["originalTitle", "isAdult", "titleType", "genres", "genres_split"], axis =1, inplace = True)
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84505 entries, 0 to 84504
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          84505 non-null  object
 1   primaryTitle    84505 non-null  object
 2   startYear       84505 non-null  int64
 3   endYear         0 non-null      float64
 4   runtimeMinutes  84505 non-null  int64
dtypes: float64(1), int64(2), object(2)
memory usage: 3.2+ MB

# Create SQL Movies Database

In [16]:
# Creating the connection 
username = "root"
password = "root" 
db_name = "Movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [17]:
#creating the engine 
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/Movies)

In [18]:
#creatiing and checking the existence of new database
if database_exists(connection) == True:
    print('The database is already exist')
else:
    create_database(connection)

The database is already exist

## title_basics table

### Creating a dataype schema for to_sql

In [19]:
## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Integer(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

### Run table.to_sql with the dtype argument

In [20]:
# Save to sql with dtype and index=False
title_basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

84505

### Run the query to ADD PRIMARY KEY

In [21]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [22]:
# show the first 5 rows
q = """
select *
from title_basics LIMIT 5;
"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,None,70
2,tt0069049,The Other Side of the Wind,2018,None,122
3,tt0088751,The Naked Monster,2005,None,100
4,tt0096056,Crime and Punishment,2002,None,126

## title_ratings table

In [23]:
# load ratings csv file
title_ratings = pd.read_csv("Data/title_ratings.csv.gz")
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1934
1  tt0000002            5.8       262
2  tt0000005            6.2      2566
3  tt0000006            5.1       176
4  tt0000007            5.4       805

In [24]:
title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 483420 entries, 0 to 483419
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         483420 non-null  object
 1   averageRating  483420 non-null  float64
 2   numVotes       483420 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.1+ MB

### Creating a dataype schema for to_sql

In [25]:
## Calculate max string lengths for object columns
key_len = title_ratings['tconst'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'averageRating': Float(),
    'numVotes':Integer()}

### Run table.to_sql with the dtype argument

In [26]:
# Save to sql with dtype and index=False
title_ratings.to_sql('title_ratings',engine,dtype=df_schema,if_exists='replace',index=False)

483420

### Run the query to ADD PRIMARY KEY

In [27]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [28]:
# show the first 5 rows
q = """
select *
from title_ratings LIMIT 5;
"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1934
1  tt0000002            5.8       262
2  tt0000005            6.2      2566
3  tt0000006            5.1       176
4  tt0000007            5.4       805

## title_genres table

In [29]:
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 157892 entries, 0 to 84504
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    157892 non-null  object
 1   genre_id  157892 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.6+ MB

### Creating a dataype schema for to_sql

In [30]:
## Calculate max string lengths for object columns
tconst_len = title_genres['tconst'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": Text(tconst_len+1), 
    'genre_id':Integer()}

### Run table.to_sql with the dtype argument

In [31]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine, dtype=df_schema, if_exists='replace',index=False)

157892

In [32]:
# show the first 5 rows
q = """
select *
from title_genres LIMIT 5;
"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

## genres table

In [33]:
genres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_name  26 non-null     object
 1   genre_id    26 non-null     int64
dtypes: int64(1), object(1)
memory usage: 544.0+ bytes

### Creating a dataype schema for to_sql

In [34]:
## Calculate max string lengths for object columns
genrename_len = genres['genre_name'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "genre_name": String(genrename_len+1), 
    'genre_id':Integer()}

### Run table.to_sql with the dtype argument

In [35]:
# Save to sql with dtype and index=False
genres.to_sql('genres',engine,dtype=df_schema, if_exists='replace',index=False)

26

### Run the query to ADD PRIMARY KEY

In [36]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [37]:
# show the first 5 rows
q = """
select *
from genres LIMIT 5;
"""
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## tmdb_data table

In [86]:
# load csv file
tmdb_data = pd.read_csv("Data/tmdb_results_combined.csv.gz")
tmdb_data.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.111,2078.0,PG

In [87]:
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2509 entries, 0 to 2508
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2509 non-null   object
 1   adult                  2507 non-null   float64
 2   backdrop_path          1328 non-null   object
 3   belongs_to_collection  200 non-null    object
 4   budget                 2507 non-null   float64
 5   genres                 2507 non-null   object
 6   homepage               173 non-null    object
 7   id                     2507 non-null   float64
 8   original_language      2507 non-null   object
 9   original_title         2507 non-null   object
 10  overview               2456 non-null   object
 11  popularity             2507 non-null   float64
 12  poster_path            2236 non-null   object
 13  production_companies   2507 non-null   object
 14  production_countries   2507 non-null   object
 15  release_date           2492 non-null   object
 16  revenue                2507 non-null   float64
 17  runtime                2507 non-null   float64
 18  spoken_languages       2507 non-null   object
 19  status                 2507 non-null   object
 20  tagline                1070 non-null   object
 21  title                  2507 non-null   object
 22  video                  2507 non-null   float64
 23  vote_average           2507 non-null   float64
 24  vote_count             2507 non-null   float64
 25  certification          798 non-null    object
dtypes: float64(9), object(17)
memory usage: 509.8+ KB

In [88]:
tmdb_data = tmdb_data[['imdb_id','revenue','budget','certification']]
tmdb_data = tmdb_data.iloc[1:]
tmdb_data

        imdb_id     revenue      budget certification
1     tt0113026         0.0  10000000.0           NaN
2     tt0113092         0.0         0.0           NaN
3     tt0116391         0.0         0.0           NaN
4     tt0118694  12854953.0    150000.0            PG
5     tt0118852         0.0         0.0             R
...         ...         ...         ...           ...
2504  tt7797670         0.0         0.0           NaN
2505  tt7797790         0.0         0.0           NaN
2506  tt8665056         0.0         0.0           NaN
2507  tt8795764         0.0         0.0            NR
2508  tt9071078         0.0         0.0           NaN

[2508 rows x 4 columns]

In [89]:
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2508 entries, 1 to 2508
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2508 non-null   object
 1   revenue        2507 non-null   float64
 2   budget         2507 non-null   float64
 3   certification  798 non-null    object
dtypes: float64(2), object(2)
memory usage: 78.5+ KB

### Creating a dataype schema for to_sql

In [90]:
## Calculate max string lengths for object columns
id_len = tmdb_data['imdb_id'].fillna('').map(len).max()
certi_len = tmdb_data['certification'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": String(id_len+1), 
    'revenue': Float(),
    'budget': Float(),
    "certification": String(certi_len+1)}

### Run table.to_sql with the dtype argument

In [91]:
# Save to sql with dtype and index=False
tmdb_data.to_sql('tmdb_data',engine, dtype=df_schema, if_exists='replace', index=False)

2508

### Run the query to ADD PRIMARY KEY

In [92]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [93]:
# show the first 5 rows
q = """
select *
from tmdb_data LIMIT 5;
"""
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0          0         NaN         NaN          None
1  tt0035423  76019000.0  48000000.0         PG-13
2  tt0113026         0.0  10000000.0          None
3  tt0113092         0.0         0.0          None
4  tt0114447         0.0         0.0          None

## Show tables

In [94]:
# Display the SQL table names using an SQL query
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data